Revit 2024 API
BuiltInFailures.RegenFailures.UserCancelled Property
 Operation is cancelled by the user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UserCancelled { get; }
Visual Basic
Public Shared ReadOnly Property UserCancelled As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UserCancelled {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace